scripts/essays/neoprags-vs-disney/neoprags-vs-disney.md

# Table of Contents

1.  [Disneyistan](#org97082a0)
2.  [Fairness is not a Libertarian Value](#orgcb3458e)
3.  [Disney as an Organ of the State](#orgc0c63f7)
4.  [CTA](#org5b3aa32)



<a id="org97082a0"></a>

# Disneyistan

Ron DeSantis&rsquo; recent move to revoke Disney&rsquo;s tax-exemption is criminal and evil, stick around and I will explain point-by-point why every counterargument to this fails. This attack came about as the result of a feud over the company&rsquo;s opposition to his &ldquo;Parental Rights in Education&rdquo; bill.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup> The resort, housed within its own self-governing pseudo-covenant called the &ldquo;Reedy Creek Improvement District,&rdquo; or (RCID) covers over 100 km<sup>2</sup>, acting with the same authority as a county government.

The Disney corporation provides emergency services,<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup><sup>, </sup><sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup><sup>, </sup><sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup> utilities,<sup><a id="fnr.5" class="footref" href="#fn.5" role="doc-backlink">5</a></sup> roads, mass-transit,<sup><a id="fnr.6" class="footref" href="#fn.6" role="doc-backlink">6</a></sup> several solar plants<sup><a id="fnr.7" class="footref" href="#fn.7" role="doc-backlink">7</a></sup> and even had plans to build its own damn nuclear reactor.<sup><a id="fnr.8" class="footref" href="#fn.8" role="doc-backlink">8</a></sup> All of this done privately, which is scarcely different from our vision of future covenant communities, we should be celebrating such an achievement, not calling for its downfall out of a desire to virtue-signal over how much we hate the woke&rsquo;s.

This pseudo-covenant decided to stand in defiance of a state law, which prompted the state to respond by robbing it en masse, no supporter of DeSantis here can be reasonably framed as a secessionist.


<a id="orgcb3458e"></a>

# Fairness is not a Libertarian Value

The neo-prag DeSantis supporters here make as their argument, that it is unfair that Disney get the supposed &ldquo;privilege&rdquo; of not having to pay taxes, and this unfair situation may be justly ironed out by revokation of said &ldquo;privilege.&rdquo; This is a framing of taxation that is completely ignorant of the law, however. Taxation itself is a criminal action done unto people, the solution to unequal taxation is not to bring in equal taxation, its to not tax anyone at all.<sup><a id="fnr.9" class="footref" href="#fn.9" role="doc-backlink">9</a></sup>

After all, the libertarian solution to a serial killer who specialises in killing white women, is not to confront this butcher and have him kill men and people of other races in equal quantities. Its certainly not fair to the women who are slaughtered by him, but fairness is not the highest libertarian virtue, we want fairness insofar as we want adherence to natural law, which is fair by its nature. But there are plenty of other fair systems that are absolutely anti-liberty, it is liberty which matters here, not fairness.

Heck, if DeSantis really wanted to stick it to the Mouse, and be entirely fair in the process, why didn&rsquo;t he revoke IP protection, or extend Disney&rsquo;s special status to its competitors such that they can maneuver without state interference? This would not only satisfy the missplaced urge some libertarians feel for fairness, but it would be entirely consistent with natural law.


<a id="orgc0c63f7"></a>

# Disney as an Organ of the State

An alternative approach the neo-prags may wish to take is to say that the Disney corporation is an arm of the state, and that its therefore fine to tax them as this is simply the state moving funds from one part of itself to another. This thesis is to be analysed in two parts, first I shall go over what it takes for a group to be considered as an arm of the state, and second I shall look at whether the taxation of such an entity really is just moving funds around.

To understand the first half of the thesis, Austrian, or more precisely Hoppean, class theory must be elucidated. Under this theory, the two classes consist on the one hand of producers, homesteaders, and traders, this is called the productive class, and on the other hand of those who expropriate the wealth of producers, homesteaders, and traders, this class is the anti-productive class.<sup><a id="fnr.10" class="footref" href="#fn.10" role="doc-backlink">10</a></sup> It is those organisations that are anti-productive that are called the state, as Franz Oppenheimer puts it, these entities make their wealth through the political as opposed to the economic means. Of particular import here is that to be truly anti-productive, simply receiving some benefits from the state is not enough, you must actually be petitioning for the expropriation of others, similarly to how it is not a crime to say &ldquo;gee, I wish someone would do something about Jeremy,&rdquo; but it is a crime to order one of your henchmen to kill Jeremy.

From this, we could say that lobbying politicians to expropriate ones competition in order to get a subsidy is a crime, but simply minding your business and accepting a subsidy that comes along is not. After all, if the latter was criminal, every person who received a stimulus cheque is now a state-actor who may now be justly taxed.

So to the extent that Disney lobbies<sup><a id="fnr.11" class="footref" href="#fn.11" role="doc-backlink">11</a></sup> for expropriation they are committing a crime, a crime that demands retribution, but in what form is this retribution? Giving money to the state? That hardly seems right&#x2014;the state wasn&rsquo;t the victim after all. But surely Disney&rsquo;s anti-productive lobbying makes them part of the state though, right?

This has two issues, first Disney is hardly characterised by anti-productive income, their anti-productive activities do exist and are legally relevant, but they do not sit around taxing people all day without bringing anything to the fold. Disney produce many products that evidently consumers enjoy to a great extent&#x2014;granted their market share is undoubtebly warped by their constant pushes for aggressive intellectual property protections, but not warped from 0. The state on the other hand is warped from 0, it does not engage in productive activities which you are allowed to not take part in.

Second, even if we classify Disney as a part of the state, we have the larger state, namely the US federal government, attempting a destruction of this smaller state through a policy of taxing it into submission. Having Disney as a state implies that its actions are state-secessionary, secession being something that is to be supported by libertarians as it is a truncation of a larger state into two smaller ones. This puts DeSantis in the position of Lincoln during the War of Southern Secession, a fact which I am sure makes neo-prags very queasy.


<a id="org5b3aa32"></a>

# CTA

If you have enjoyed this response to the anti-Disney-pro-DeSantis-neo-prag wave, you have to watch this video where I point out the core flaws of neo-pragmatism as such, this will allow you to more effectively understand the flaws in their reasoning so that you will already know what missteps they are making in the future.


# Footnotes

<sup><a id="fn.1" href="#fnr.1">1</a></sup> Giulia Heyward, &ldquo;Why Did DeSantis Revoke Disney’s Special Tax Status? What We Know.&rdquo; ([archived](https://archive.ph/dImkm))

<sup><a id="fn.2" href="#fnr.2">2</a></sup> <https://disneyworld.disney.go.com/guest-services/park-security/>

<sup><a id="fn.3" href="#fnr.3">3</a></sup> <https://www.firerescue1.com/fire-careers/articles/reedy-creek-the-happiest-fire-department-on-earth-2hhZHnFvOF73Mevr/>

<sup><a id="fn.4" href="#fnr.4">4</a></sup> <https://disneythemeparks.fandom.com/wiki/Reedy_Creek_Emergency_Services>

<sup><a id="fn.5" href="#fnr.5">5</a></sup> <https://en.wikipedia.org/wiki/Reedy_Creek_Energy_Services>

<sup><a id="fn.6" href="#fnr.6">6</a></sup> <https://en.wikipedia.org/wiki/Disney_Transport>

<sup><a id="fn.7" href="#fnr.7">7</a></sup> Hiller, Jake (January 28, 2019). [&ldquo;Why Disney World Is Betting On Clean Energy&rdquo;](https://www.forbes.com/sites/edfenergyexchange/2019/01/28/why-disney-world-is-betting-on-clean-energy/#41dcfc7c6722). *Forbes*. Retrieved March 7, 2019.

<sup><a id="fn.8" href="#fnr.8">8</a></sup> James Conca, &ldquo;Disney World Could Have Gone Nuclear.&rdquo; ([archived](https://archive.ph/EfqNy))

<sup><a id="fn.9" href="#fnr.9">9</a></sup> For this see Ryan McMaken, &ldquo;[The Answer to &ldquo;Unfair&rdquo; Tax Breaks Is More Tax Breaks](https://mises.org/wire/answer-unfair-tax-breaks-more-tax-breaks),&rdquo; ([archived](https://archive.ph/NTj06)), debunking Ryan McMaken, &ldquo;[Disney&rsquo;s Corporate Welfare Is Modern Mercantilism](https://mises.org/wire/disneys-corporate-welfare-modern-mercantilism),&rdquo; ([archived](https://archive.ph/hHite)).

<sup><a id="fn.10" href="#fnr.10">10</a></sup> See on this, Hoppe, Hans-Hermann. &ldquo;Marxist and Austrian Class Analysis.&rdquo; *Journal of Libertarian Studies* 9, No. 2 (1990): 79–93.

<sup><a id="fn.11" href="#fnr.11">11</a></sup> <https://www.opensecrets.org/federal-lobbying/clients/summary?cycle=2021&id=d000000128>, <https://archive.ph/3VkOM>
